OttoMeister/esp32-metar-weather/src/main.cpp
/* ESP32S board - 8048S043C -  4.3-inch TFT 800x480 - Capacitive touch - 8M PSRAM 16M Flash
pio pkg update -e esp32-8048S043C
pio run -t clean -e esp32-8048S043C
pio run -e esp32-8048S043C
pio run -e esp32-8048S043C --upload-port  /dev/ttyUSB0 -t upload
pio run -e esp32-8048S043C --monitor-port /dev/ttyUSB0 -t monitor
https://formatter.org/cpp-formatter
*/

#include <Arduino.h>
#include <ArduinoJson.h>
#include <HTTPClient.h>
#include <NTPClient.h>
#include <Preferences.h>
#include <WiFi.h>
#include <esp32_smartdisplay.h>
#include <lvgl.h>
#include <math.h>
#include <cmath>
#include <strings.h>

Preferences preferences;

struct UIElements {
    lv_obj_t *scrMain;
    lv_obj_t *pnlMain;
    lv_obj_t *lblTemperature;
    lv_obj_t *lblHumidity;
    lv_obj_t *lblWindSpeed;
    lv_obj_t *lblPressure;
    lv_obj_t *lblTimeDate;
    lv_obj_t *lblWifiStatus;
    lv_obj_t *lblAirportName;
    lv_obj_t *lblDataAge;
    lv_obj_t *lblSunrise;
    lv_obj_t *lblSunset;
    lv_obj_t *lblBigTime;
    lv_obj_t *lblBigDate;
    lv_obj_t *scrSetting;
    lv_obj_t *taSSID;
    lv_obj_t *taPassword;
    lv_obj_t *taMetarId;
    lv_obj_t *taTimeOffset;
    lv_obj_t *kb;
};

UIElements ui;

struct Config {
    char ssid[64] = "";
    char password[64] = "";
    char metar_id[10] = ""; 
    long time_offset = 0;
};

Config config;

// NTP and time client
WiFiUDP ntpUDP;
NTPClient timeClient(ntpUDP);

enum WiFiState {
  DISCONNECTED,
  CONNECTING,
  CONNECTED,
  RECONNECTING
};

struct WiFiManagement {
    WiFiState state = DISCONNECTED;
    unsigned long last_connect_attempt = 0;
    unsigned long connect_start_time = 0;
};

WiFiManagement wifi_mgmt;

struct WeatherData {
    int temperature = 0;
    int dew_point = 0;
    int wind_speed_knots = 0;
    int pressure = 0;
    int relative_humidity = 0;
    int wind_speed_kmh = 0;
    char airport_name[100] = "";
    unsigned long obsTime = 0;
    float lat = 0;
    float lon = 0;
    bool weather_is_valid = false;
    bool UTC_Offset_is_valid = false;
    String sunrise;
    String sunset;
};

WeatherData weather;

// Normalize string by replacing accented characters
String normalizeString(String str) {
  static const char *replacements[][2] = {
    {"á", "a"},  {"à", "a"},  {"â", "a"},  {"ã", "a"},  {"ä", "ae"}, {"æ", "ae"}, {"Á", "A"},  {"À", "A"}, 
    {"Â", "A"},  {"Ã", "A"},  {"Ä", "Ae"}, {"Æ", "AE"}, {"é", "e"},  {"è", "e"},  {"ê", "e"},  {"ë", "e"}, 
    {"É", "E"},  {"È", "E"},  {"Ê", "E"},  {"Ë", "E"},  {"í", "i"},  {"ì", "i"},  {"î", "i"},  {"ï", "i"}, 
    {"Í", "I"},  {"Ì", "I"},  {"Î", "I"},  {"Ï", "I"},  {"ó", "o"},  {"ò", "o"},  {"ô", "o"},  {"õ", "o"}, 
    {"ö", "oe"}, {"œ", "oe"}, {"Ó", "O"},  {"Ò", "O"},  {"Ô", "O"},  {"Õ", "O"},  {"Ö", "Oe"}, {"Œ", "OE"}, 
    {"ú", "u"},  {"ù", "u"},  {"û", "u"},  {"ü", "ue"}, {"Ú", "U"},  {"Ù", "U"},  {"Û", "U"},  {"Ü", "Ue"},
    {"ñ", "n"},  {"Ñ", "N"},  {"ç", "c"},  {"Ç", "C"},  {"ÿ", "y"},  {"Ÿ", "Y"},  {"ß", "ss"}, {"ẞ", "SS"}};
  String result = str;
  for (auto &pair : replacements) 
    result.replace(pair[0], pair[1]);
  return result;
}

// Update label text with formatted string
void update_label(lv_obj_t *label, const char *format, ...) {
  char buffer[128];
  va_list args;
  va_start(args, format);
  vsnprintf(buffer, sizeof(buffer), format, args);
  va_end(args);
  lv_label_set_text(label, buffer);
}

// Save configuration settings
void save_configurations() {
  preferences.begin("config", false);
  preferences.putString("ssid", config.ssid);
  preferences.putString("password", config.password);
  preferences.putString("metar_id", config.metar_id);
  preferences.putInt("time_offset", config.time_offset);
  preferences.end();
  log_i("Saved configurations: SSID: \"%s\", Password: \"%s\", METAR ID: \"%s\", Time Offset: \"%i\"", config.ssid, config.password, config.metar_id, config.time_offset);
}

// Load configuration settings
void load_configurations() {
  preferences.begin("config", true);
  preferences.getString("ssid", config.ssid, sizeof(config.ssid));
  preferences.getString("password", config.password, sizeof(config.password));
  preferences.getString("metar_id", config.metar_id, sizeof(config.metar_id));
  config.time_offset = preferences.getInt("time_offset");
  preferences.end();
  log_i("Loaded configurations: SSID: \"%s\", Password: \"%s\", METAR ID: \"%s\", Time Offset: \"%i\"", config.ssid, config.password, config.metar_id, config.time_offset);
}

// Event handler for settings button
void ui_event_btnSettings(lv_event_t *e) {
  if (lv_event_get_code(e) == LV_EVENT_CLICKED) lv_disp_load_scr(ui.scrSetting);
}

void ui_event_btnBack(lv_event_t *e) {
  if (lv_event_get_code(e) == LV_EVENT_CLICKED) {
    String tempSsid = lv_textarea_get_text(ui.taSSID);
    tempSsid.trim();
    strlcpy(config.ssid, tempSsid.c_str(), sizeof(config.ssid));
    strlcpy(config.password, lv_textarea_get_text(ui.taPassword) ? lv_textarea_get_text(ui.taPassword) : "", sizeof(config.password));
    String rawMetar = lv_textarea_get_text(ui.taMetarId);
    rawMetar.trim();
    rawMetar.toUpperCase();
    strlcpy(config.metar_id, rawMetar.substring(0, 4).c_str(), sizeof(config.metar_id));
    config.time_offset = lv_textarea_get_text(ui.taTimeOffset) ? strtol(lv_textarea_get_text(ui.taTimeOffset), nullptr, 10) : 0;
    save_configurations();
    timeClient.setTimeOffset(config.time_offset);
    lv_disp_load_scr(ui.scrMain);
  }
}

void wifi_management_cb(lv_timer_t *timer) {         
  lv_obj_t *current_screen = lv_disp_get_scr_act(NULL);
  if (current_screen == ui.scrMain) {
    switch (wifi_mgmt.state) {
      case DISCONNECTED:
        if (millis() - wifi_mgmt.last_connect_attempt >= 10000) {
          log_i("Starting WiFi connection to %s", config.ssid);
          WiFi.begin(config.ssid, config.password);
          wifi_mgmt.connect_start_time = millis();
          wifi_mgmt.last_connect_attempt = millis();
          wifi_mgmt.state = CONNECTING;
          update_label(ui.lblWifiStatus, LV_SYMBOL_WIFI " Connecting...");
        } else update_label(ui.lblWifiStatus, LV_SYMBOL_CLOSE " Disconnected");
        break;
      case CONNECTING:
        if (WiFi.status() == WL_CONNECTED) {
          wifi_mgmt.state = CONNECTED;
          log_i("WiFi: Connected to %s with %d dBm", WiFi.SSID().c_str(), WiFi.RSSI()); 
        } else if (millis() - wifi_mgmt.connect_start_time >= 10000) {
          log_i("WiFi connection timeout");
          WiFi.disconnect();
          wifi_mgmt.state = DISCONNECTED;
          update_label(ui.lblWifiStatus, LV_SYMBOL_CLOSE " Connection Failed");
        } else update_label(ui.lblWifiStatus, LV_SYMBOL_WIFI " Connecting...");
        break;
      case CONNECTED:
        if (WiFi.status() != WL_CONNECTED) {
          wifi_mgmt.state = RECONNECTING;
          log_i("WiFi connection lost");
          update_label(ui.lblWifiStatus, LV_SYMBOL_CLOSE " Connection Lost");
        } else update_label(ui.lblWifiStatus, LV_SYMBOL_WIFI " %s", WiFi.SSID().c_str()); 
        break;
      case RECONNECTING:
        if (millis() - wifi_mgmt.last_connect_attempt >= 10000) {
          log_i("Attempting to reconnect WiFi");
          WiFi.reconnect();
          wifi_mgmt.connect_start_time = millis();
          wifi_mgmt.last_connect_attempt = millis();
          wifi_mgmt.state = CONNECTING;
          update_label(ui.lblWifiStatus, LV_SYMBOL_WIFI " Reconnecting...");
        } else update_label(ui.lblWifiStatus, LV_SYMBOL_CLOSE " Connection Lost");
        break;
    }
  } else if (current_screen == ui.scrSetting) {
    if (WiFi.status() == WL_CONNECTED) {
      log_i("Disconnecting WiFi (settings screen active)");
      WiFi.disconnect();
    }
    wifi_mgmt.state = DISCONNECTED;
    update_label(ui.lblWifiStatus, LV_SYMBOL_CLOSE " Disconnected");
  }
}

// Show keyboard for text area input
void show_keyboard(lv_event_t *e, lv_obj_t *textarea) {
  if (lv_event_get_code(e) == LV_EVENT_CLICKED) {
    lv_keyboard_set_textarea(ui.kb, textarea);
    lv_obj_clear_flag(ui.kb, LV_OBJ_FLAG_HIDDEN);
  }
}

// Event handlers for text areas
void ui_event_taSSID(lv_event_t *e) { show_keyboard(e, ui.taSSID); }
void ui_event_taPassword(lv_event_t *e) { show_keyboard(e, ui.taPassword); }
void ui_event_taMetarId(lv_event_t *e) { show_keyboard(e, ui.taMetarId); }
void ui_event_taTimeOffset(lv_event_t *e) { show_keyboard(e, ui.taTimeOffset); }

// Handle keyboard events
void ui_event_kb(lv_event_t *e) {
  if (lv_event_get_code(e) == LV_EVENT_READY || lv_event_get_code(e) == LV_EVENT_CANCEL) 
    lv_obj_add_flag(ui.kb, LV_OBJ_FLAG_HIDDEN);
}

// Create a styled card panel
lv_obj_t *create_card(lv_obj_t *parent, int x, int y, int w, int h) {
  lv_obj_t *card = lv_obj_create(parent);
  lv_obj_set_size(card, w, h);
  lv_obj_set_pos(card, x, y);
  lv_obj_remove_flag(card, LV_OBJ_FLAG_SCROLLABLE);
  
  // Card styling
  lv_obj_set_style_bg_color(card, lv_color_hex(0x1a1a1a), LV_PART_MAIN);
  lv_obj_set_style_bg_grad_color(card, lv_color_hex(0x2a2a2a), LV_PART_MAIN);
  lv_obj_set_style_bg_grad_dir(card, LV_GRAD_DIR_VER, LV_PART_MAIN);
  lv_obj_set_style_radius(card, 10, LV_PART_MAIN);
  lv_obj_set_style_border_width(card, 1, LV_PART_MAIN);
  lv_obj_set_style_border_color(card, lv_color_hex(0x444444), LV_PART_MAIN);
  lv_obj_set_style_shadow_width(card, 8, LV_PART_MAIN);
  lv_obj_set_style_shadow_color(card, lv_color_black(), LV_PART_MAIN);
  lv_obj_set_style_shadow_opa(card, LV_OPA_50, LV_PART_MAIN);
  lv_obj_set_style_shadow_offset_x(card, 2, LV_PART_MAIN);
  lv_obj_set_style_shadow_offset_y(card, 2, LV_PART_MAIN);
  
  return card;
}

// Create a styled label with icon
lv_obj_t *create_styled_label(lv_obj_t *parent, int x, int y, const char *text, const char *icon = nullptr) {
  lv_obj_t *label = lv_label_create(parent);
  lv_obj_set_pos(label, x, y);
  char full_text[200];
  if (icon) snprintf(full_text, sizeof(full_text), "%s %s", icon, text);
  else strlcpy(full_text, text, sizeof(full_text)); 
  lv_label_set_text(label, full_text);
  lv_obj_set_style_text_color(label, lv_color_white(), LV_PART_MAIN);
  lv_obj_set_style_text_font(label, LV_FONT_DEFAULT, LV_PART_MAIN);
  return label;
}

// Create a gradient button with icon
lv_obj_t *create_gradient_button(lv_obj_t *parent, int x, int y, int w, int h, const char *text, const char *icon, lv_event_cb_t event_cb) {
  lv_obj_t *btn = lv_button_create(parent);
  lv_obj_set_size(btn, w, h);
  lv_obj_set_pos(btn, x, y);
  
  // Button styling
  lv_obj_set_style_bg_color(btn, lv_color_hex(0x3366ff), LV_PART_MAIN);
  lv_obj_set_style_bg_grad_color(btn, lv_color_hex(0x1a4dff), LV_PART_MAIN);
  lv_obj_set_style_bg_grad_dir(btn, LV_GRAD_DIR_VER, LV_PART_MAIN);
  lv_obj_set_style_radius(btn, 8, LV_PART_MAIN);
  lv_obj_set_style_border_width(btn, 1, LV_PART_MAIN);
  lv_obj_set_style_border_color(btn, lv_color_hex(0x4d79ff), LV_PART_MAIN);
  lv_obj_set_style_shadow_width(btn, 4, LV_PART_MAIN);
  lv_obj_set_style_shadow_color(btn, lv_color_black(), LV_PART_MAIN);
  lv_obj_set_style_shadow_opa(btn, LV_OPA_30, LV_PART_MAIN);
  
  // Pressed state
  lv_obj_set_style_bg_color(btn, lv_color_hex(0x1a4dff), LV_PART_MAIN | LV_STATE_PRESSED);
  lv_obj_set_style_bg_grad_color(btn, lv_color_hex(0x0d33cc), LV_PART_MAIN | LV_STATE_PRESSED);
  
  // Label with icon
  lv_obj_t *lbl = lv_label_create(btn);
  lv_obj_center(lbl);
  
  char full_text[64];
  if (icon) snprintf(full_text, sizeof(full_text), "%s %s", icon, text);
  else strlcpy(full_text, text, sizeof(full_text));
  
  lv_label_set_text(lbl, full_text);
  lv_obj_set_style_text_color(lbl, lv_color_white(), LV_PART_MAIN);
  lv_obj_set_style_text_font(lbl, LV_FONT_DEFAULT, LV_PART_MAIN);
  
  if (event_cb) lv_obj_add_event_cb(btn, event_cb, LV_EVENT_ALL, NULL);
  
  return btn;
}

// Create a text area with modern styling
lv_obj_t *create_modern_textarea(lv_obj_t *parent, int x, int y, int w, int h, bool one_line, bool password_mode, lv_event_cb_t event_cb, const char *initial_text, const char *placeholder) {
  lv_obj_t *ta = lv_textarea_create(parent);
  lv_obj_set_size(ta, w, h);
  lv_obj_set_pos(ta, x, y);
  lv_textarea_set_one_line(ta, one_line);
  lv_textarea_set_password_mode(ta, password_mode);
  if (placeholder) lv_textarea_set_placeholder_text(ta, placeholder);
  
  // Modern styling
  lv_obj_set_style_bg_color(ta, lv_color_hex(0x2a2a2a), LV_PART_MAIN);
  lv_obj_set_style_bg_grad_color(ta, lv_color_hex(0x1a1a1a), LV_PART_MAIN);
  lv_obj_set_style_bg_grad_dir(ta, LV_GRAD_DIR_VER, LV_PART_MAIN);
  lv_obj_set_style_text_color(ta, lv_color_white(), LV_PART_MAIN);
  lv_obj_set_style_radius(ta, 6, LV_PART_MAIN);
  lv_obj_set_style_border_width(ta, 1, LV_PART_MAIN);
  lv_obj_set_style_border_color(ta, lv_color_hex(0x444444), LV_PART_MAIN);
  lv_obj_set_style_pad_all(ta, 8, LV_PART_MAIN);
  
