OttoMeister/esp32-metar-weather/src/main.cpp
  // Focus styling
  lv_obj_set_style_border_color(ta, lv_color_hex(0x3366ff), LV_PART_MAIN | LV_STATE_FOCUSED);
  lv_obj_set_style_border_width(ta, 2, LV_PART_MAIN | LV_STATE_FOCUSED);
  
  // Cursor styling
  lv_obj_set_style_bg_color(ta, lv_color_white(), LV_PART_CURSOR);
  
  if (event_cb) lv_obj_add_event_cb(ta, event_cb, LV_EVENT_ALL, NULL);
  lv_textarea_set_text(ta, initial_text);
  
  return ta;
}

// Initialize main screen with improved layout and better spacing
void ui_scrMain_screen_init(void) {
  ui.scrMain = lv_obj_create(NULL);
  lv_obj_remove_flag(ui.scrMain, LV_OBJ_FLAG_SCROLLABLE);
  lv_obj_set_style_bg_color(ui.scrMain, lv_color_hex(0x0d1117), LV_PART_MAIN);
  lv_obj_set_style_bg_grad_color(ui.scrMain, lv_color_hex(0x161b22), LV_PART_MAIN);
  lv_obj_set_style_bg_grad_dir(ui.scrMain, LV_GRAD_DIR_VER, LV_PART_MAIN);
  // Header card 
  lv_obj_t *header_card = create_card(ui.scrMain, 5, 5, 790, 80);
  ui.lblWifiStatus = create_styled_label(header_card, 0, -5, "Disconnected", LV_SYMBOL_CLOSE);
  ui.lblTimeDate = create_styled_label(header_card, 0, 25, "Time: --", LV_SYMBOL_LIST);
  create_gradient_button(header_card,  650, 0, 110, 40, "Settings", LV_SYMBOL_SETTINGS, ui_event_btnSettings);
  // Airport info card
  lv_obj_t *airport_card = create_card(ui.scrMain, 5, 90, 790, 45);
  ui.lblAirportName = create_styled_label(airport_card, 0, -5, "Airport: --", LV_SYMBOL_HOME);
  ui.lblDataAge = create_styled_label(airport_card, 400, -5, "Data Age: -- min", LV_SYMBOL_REFRESH);  
  // Weather data card - left side
  lv_obj_t *weather_card = create_card(ui.scrMain, 5, 140, 390, 185);
  lv_obj_t *weather_title = create_styled_label(weather_card, 0, -5, "Weather Data", LV_SYMBOL_EYE_OPEN);
  lv_obj_set_style_text_color(weather_title, lv_color_hex(0x3366ff), LV_PART_MAIN);
  ui.lblTemperature = create_styled_label(weather_card, 0, 25, "Temperature: -- °C", LV_SYMBOL_BATTERY_3);
  ui.lblHumidity = create_styled_label(weather_card, 0, 55, "Humidity: -- %", LV_SYMBOL_TINT);
  ui.lblWindSpeed = create_styled_label(weather_card, 0, 85, "Wind Speed: -- km/h", LV_SYMBOL_GPS);
  ui.lblPressure = create_styled_label(weather_card, 0, 115, "Pressure: -- hPa", LV_SYMBOL_POWER);
  // Sun times card - right side
  lv_obj_t *sun_card = create_card(ui.scrMain, 405, 140, 390, 185);
  lv_obj_t *sun_title = create_styled_label(sun_card, 0, -5, "Sun Times", LV_SYMBOL_WIFI);
  lv_obj_set_style_text_color(sun_title, lv_color_hex(0xffa500), LV_PART_MAIN);
  ui.lblSunrise = create_styled_label(sun_card, 0, 25, "Sunrise: --", LV_SYMBOL_UP);
  ui.lblSunset = create_styled_label(sun_card, 0, 55, "Sunset: --", LV_SYMBOL_DOWN);
  lv_obj_t *info_label1 = create_styled_label(sun_card, 0, 85, "Daylight Info", nullptr);
  lv_obj_set_style_text_color(info_label1, lv_color_hex(0x888888), LV_PART_MAIN);
   // Big time date card 
  lv_obj_t *big_time_date_card = create_card(ui.scrMain, 5, 330, 790, 95);
  ui.lblBigTime = lv_label_create(big_time_date_card);
  lv_obj_align(ui.lblBigTime, LV_ALIGN_TOP_LEFT, 0, 0);
  lv_obj_set_style_text_color(ui.lblBigTime, lv_color_white(), LV_PART_MAIN);
  lv_obj_set_style_text_font(ui.lblBigTime, &lv_font_montserrat_48, LV_PART_MAIN);
  lv_label_set_text(ui.lblBigTime, "--:--:--"); 
  ui.lblBigDate = lv_label_create(big_time_date_card);
  lv_obj_align(ui.lblBigDate,  LV_ALIGN_TOP_LEFT, 250, 0);
  lv_obj_set_style_text_color(ui.lblBigDate, lv_color_white(), LV_PART_MAIN);
  lv_obj_set_style_text_font(ui.lblBigDate, &lv_font_montserrat_48, LV_PART_MAIN);
  lv_label_set_text(ui.lblBigDate, "--.--.----"); 
   // Status card 
  lv_obj_t *status_card = create_card(ui.scrMain, 5, 430, 790, 45);
  lv_obj_t *status_label = create_styled_label(status_card, 0, -5, "ESP32 METAR Weather Station", LV_SYMBOL_EYE_OPEN);
  lv_obj_set_style_text_color(status_label, lv_color_hex(0x3366ff), LV_PART_MAIN);
  lv_obj_t *version_label = create_styled_label(status_card, 600, -5, "v1.0", nullptr);
  lv_obj_set_style_text_color(version_label, lv_color_hex(0x888888), LV_PART_MAIN);
}

// Initialize settings screen with modern design and better spacing
void ui_scrSetting_screen_init(void) {
  ui.scrSetting = lv_obj_create(NULL);
  lv_obj_remove_flag(ui.scrSetting, LV_OBJ_FLAG_SCROLLABLE);
  lv_obj_set_style_bg_color(ui.scrSetting, lv_color_hex(0x0d1117), LV_PART_MAIN);
  lv_obj_set_style_bg_grad_color(ui.scrSetting, lv_color_hex(0x161b22), LV_PART_MAIN);
  lv_obj_set_style_bg_grad_dir(ui.scrSetting, LV_GRAD_DIR_VER, LV_PART_MAIN);
  // Setting Header card 
  lv_obj_t *header_card = create_card(ui.scrSetting, 5, 5, 790, 70);
  lv_obj_t *title = create_styled_label(header_card, 0, 5, "Weather Station Settings", LV_SYMBOL_SETTINGS);
  lv_obj_set_style_text_color(title, lv_color_hex(0x3366ff), LV_PART_MAIN);
  create_gradient_button(header_card, 650, -5, 110, 40, "Save", LV_SYMBOL_SAVE, ui_event_btnBack);
  // Settings card 
  lv_obj_t *form_card = create_card(ui.scrSetting, 5, 80, 790, 345);
  lv_obj_t *ssid_label = create_styled_label(form_card, 0, -5, "WiFi Network (SSID):");
  lv_obj_set_style_text_color(ssid_label, lv_color_hex(0xcccccc), LV_PART_MAIN);
  ui.taSSID = create_modern_textarea(form_card, 0, 20, 300, 35, true, false, ui_event_taSSID, config.ssid, "Enter WiFi SSID");
  lv_obj_t *pwd_label = create_styled_label(form_card, 360, -5, "WiFi Password:");
  lv_obj_set_style_text_color(pwd_label, lv_color_hex(0xcccccc), LV_PART_MAIN);
  ui.taPassword = create_modern_textarea(form_card, 360, 20, 300, 35, true, true, ui_event_taPassword, config.password, "Enter password");
  lv_obj_t *metar_label = create_styled_label(form_card, 0, 75, "METAR ID (4 letters):");
  lv_obj_set_style_text_color(metar_label, lv_color_hex(0xcccccc), LV_PART_MAIN);
  ui.taMetarId = create_modern_textarea(form_card, 0, 100, 300, 35, true, false, ui_event_taMetarId, config.metar_id, "e.g. KJFK");
  lv_obj_t *offset_label = create_styled_label(form_card, 360, 75, "Time Offset (seconds):");
  lv_obj_set_style_text_color(offset_label, lv_color_hex(0xcccccc), LV_PART_MAIN);
  ui.taTimeOffset = create_modern_textarea(form_card, 360, 100, 300, 35, true, false, ui_event_taTimeOffset, String(config.time_offset).c_str(), "UTC offset");
  // Help card 
  lv_obj_t *help_card = create_card(ui.scrSetting, 5, 430, 790, 45);
  lv_obj_t *help_title = create_styled_label(help_card, 0, -5, "Help:", nullptr);
  lv_obj_set_style_text_color(help_title, lv_color_hex(0x3366ff), LV_PART_MAIN);
  lv_obj_t *help_text = create_styled_label(help_card, 50, -5, "METAR ID: Find airport codes at wikipedia.org/wiki/ICAO_airport_code", nullptr);
  lv_obj_set_style_text_color(help_text, lv_color_hex(0x888888), LV_PART_MAIN); 
  // Keyboard - positioned better
  ui.kb = lv_keyboard_create(ui.scrSetting);
  lv_keyboard_set_textarea(ui.kb, ui.taSSID);
  lv_obj_add_flag(ui.kb, LV_OBJ_FLAG_HIDDEN);
  lv_obj_set_style_text_color(ui.kb, lv_color_white(), LV_PART_MAIN);
  lv_obj_set_style_bg_color(ui.kb, lv_color_hex(0x1a1a1a), LV_PART_MAIN);
  lv_obj_add_event_cb(ui.kb, ui_event_kb, LV_EVENT_ALL, NULL);
  // Position keyboard at bottom when visible
  lv_obj_set_size(ui.kb, 770, 150);
  lv_obj_align(ui.kb, LV_ALIGN_BOTTOM_MID, 0, -10);
}

// Initialize UI with modern theme
void ui_init(void) {
  lv_disp_t *display = lv_display_get_default();
  lv_theme_t *theme = lv_theme_default_init(display, lv_palette_main(LV_PALETTE_BLUE), lv_palette_main(LV_PALETTE_RED), true, LV_FONT_DEFAULT);
  lv_disp_set_theme(display, theme);
  
  ui_scrMain_screen_init();
  ui_scrSetting_screen_init();
  lv_disp_load_scr(ui.scrMain);
}

