OttoMeister/esp32-metar-weather/src/main.cpp
bool weatherData() {
  HTTPClient http;
  http.setTimeout(10000);  
  WiFiClientSecure client;
  client.setInsecure();    
  char urlBuffer[100];
  if (WiFi.status() != WL_CONNECTED) return false;
  if (WiFi.localIP() == IPAddress(0, 0, 0, 0))  return false;
  snprintf(urlBuffer, sizeof(urlBuffer), "https://aviationweather.gov/api/data/metar?ids=%s&format=json", config.metar_id);
  log_i("Fetching METAR from: %s via HTTPS", urlBuffer);
  if (!http.begin(client, urlBuffer)) {
    log_i("Failed to initialize HTTPS connection");
    http.end();
    return false;
  }
  http.setReuse(false); 
  int httpCode = http.GET();
  if (httpCode != 200) {
    String errorResponse = http.getString();
    log_i("HTTP request failed with code: %d, Response: %s", httpCode, errorResponse.substring(0, 200).c_str());
    http.end();
     return false;
  }
  String responseStr = http.getString();
  if (responseStr.length() == 0) {
    log_i("Empty response received");
    http.end();
     return false;
  }
  http.end();
  JsonDocument doc;
  DeserializationError error = deserializeJson(doc, responseStr);
  if (error) {
    log_i("JSON parsing failed: %s", error.c_str());
     return false;
  }
  if (!doc.is<JsonArray>() || doc.as<JsonArray>().size() == 0) {
    log_i("Invalid METAR JSON structure: not an array or empty");
     return false;
  }
  JsonObject obj = doc[0].as<JsonObject>();
  if (obj["icaoId"].isNull() || obj["temp"].isNull()) {
    log_i("Invalid METAR JSON structure: missing icaoId or temp");
     return false;
  }
  const char* newId = obj["icaoId"];
  if (strcmp(newId, config.metar_id) != 0) {
    log_i("METAR ID mismatch: %s vs %s", newId, config.metar_id);
     return false;
  }
  weather.temperature = obj["temp"] | 0;
  weather.dew_point = obj["dewp"] | 0;
  weather.wind_speed_knots = obj["wspd"] | 0;
  weather.pressure = obj["altim"] | 0;
  weather.obsTime = obj["obsTime"] | 0;
  weather.lat = obj["lat"].as<float>();
  weather.lon = obj["lon"].as<float>();
  weather.wind_speed_kmh = weather.wind_speed_knots * 1.852;
  float t = weather.temperature, d = weather.dew_point;
  weather.relative_humidity = 100 * exp((17.625 * d) / (243.04 + d)) / exp((17.625 * t) / (243.04 + t));
  const char* name = obj["name"] | "Unknown";
  String normalized = normalizeString(name);
  strncpy(weather.airport_name, normalized.c_str(), sizeof(weather.airport_name) - 1);
  weather.airport_name[sizeof(weather.airport_name) - 1] = '\0';
  log_i("METAR updated: T=%d°C, DP=%d°C, WS=%dkn, P=%dhPa, RH=%d%% Lat=%.3f, Lon=%.3f",
        weather.temperature, weather.dew_point, weather.wind_speed_knots, weather.pressure, weather.relative_humidity, weather.lat, weather.lon);
  return true;
}

// Returns true if successful, sets offset_seconds
bool getUtcOffset(float lat, float lon, long &offset_seconds) {
  HTTPClient http;
  WiFiClientSecure client;
  client.setInsecure(); 
  char url[128];
  if (WiFi.status() != WL_CONNECTED) return false;
  if (WiFi.localIP() == IPAddress(0, 0, 0, 0))  return false;
  if (lat == 0 && lon == 0) { log_i("no lat and lon values for getUtcOffset()"); return false; }
  snprintf(url, sizeof(url), 
    "https://timeapi.io/api/TimeZone/coordinate?latitude=%.5f&longitude=%.5f", lat, lon);
  log_i("Fetching time offset from: %s via HTTPS", url);
  if (!http.begin(client, url)) {
    log_i("Failed to connect to timeapi.io");
    http.end();
    return false;
  }
  int httpCode = http.GET();
  if (httpCode != 200) {
    log_i("timeapi.io returned HTTP %d", httpCode);
    http.end();
    return false;
  }
  String payload = http.getString();
  http.end();
  JsonDocument doc;
  DeserializationError err = deserializeJson(doc, payload);
  if (err) {
    log_i("Failed to parse JSON: %s", err.c_str());
    return false;
  }
  if (!doc["currentUtcOffset"].is<JsonObject>()) {
    log_i("JSON does not contain valid 'currentUtcOffset' object");
    return false;
  }
  if (!doc["currentUtcOffset"]["seconds"].is<long>()) {
    log_i("currentUtcOffset does not contain valid 'seconds' field");
    return false;
  }
  offset_seconds = doc["currentUtcOffset"]["seconds"];
  log_i("UTC Offset for (%.5f, %.5f) is %ld seconds", lat, lon, offset_seconds);
  return true;
}

#define LEAP_YEAR(Y) ((Y>0)&&!(Y%4)&&((Y%100)||!(Y%400)))
String getFormattedDate(unsigned long e){
 unsigned long d=e/86400L,t=0;int y=1970,m=0;
 static const uint8_t md[]={31,28,31,30,31,30,31,31,30,31,30,31};
 while((t+=LEAP_YEAR(y)?366:365)<=d)y++;
 d-=t-(LEAP_YEAR(y)?366:365);
 for(;m<12&&d>=(m==1&&LEAP_YEAR(y)?29:md[m]);m++)d-=m==1&&LEAP_YEAR(y)?29:md[m];
 char b[20];snprintf(b,sizeof(b),"%02lu-%02d-%04d",d+1,m+1,y);return String(b);
}

String getFormattedTime(unsigned long e){
 unsigned long t=e%86400;char b[9];
 snprintf(b,sizeof(b),"%02u:%02u:%02u",(uint)(t/3600),(uint)((t%3600)/60),(uint)(t%60));
 return String(b);
}

// rise = true = sunrise // rise = false = sunset
String sun_event(unsigned long t, float lat, float lon, bool rise, long time_offset) {
  log_i("Time: %s %s", getFormattedTime(t).c_str(), getFormattedDate(t).c_str());
  log_i("Sun_event input: t=%lu, lat=%.3f, lon=%.3f, rise=%d, time_offset=%ld", t, lat, lon, rise, time_offset);
  double n = t / 86400.0 - 10957.5, L = fmod(280.46 + 0.9856474 * n, 360) * 0.017453293;
  double g = fmod(357.528 + 0.9856003 * n, 360) * 0.017453293, lam = L + 0.033423 * sin(g) + 0.000349 * sin(2*g);
  double decl = asin(0.39782 * sin(lam)), EoT = 4 * (L * 57.295779 - atan2(0.91746 * sin(lam), cos(lam)) * 57.295779);
  if (EoT > 720) EoT -= 1440; 
  if (EoT < -720) EoT += 1440;
  double cosh = (sin(-0.014544) - sin(lat * 0.017453293) * sin(decl)) / (cos(lat * 0.017453293) * cos(decl));
  if (cosh < -1 || cosh > 1) return String(cosh < -1 ? "No sunset" : "No sunrise");
  double h = acos(cosh) * 57.295779, stime = fmod(12 - lon/15 - EoT/60 + (rise ? -h : h)/15 + 24, 24);
  t = (t/86400)*86400 + (unsigned long)(stime * 3600) + time_offset;
  char buf[32]; 
  snprintf(buf, 32, "%02d:%02d:%02d", (int)(t%86400)/3600, (int)(t%3600)/60, (int)t%60);
  return String(buf);
}

// Update time and date display
void update_time_cb(lv_timer_t *timer) {
  if (WiFi.status() != WL_CONNECTED) return; // Exit if not connected to WiFi
  timeClient.update();
  unsigned long epochtime = timeClient.getEpochTime();
    update_label(ui.lblTimeDate, LV_SYMBOL_LIST " %s %s", getFormattedTime(epochtime).c_str(), getFormattedDate(epochtime).c_str());
    if (ui.lblBigTime && ui.lblBigDate) {
      lv_label_set_text_fmt(ui.lblBigTime, "%s", getFormattedTime(epochtime).c_str());
      lv_label_set_text_fmt(ui.lblBigDate, "%s", getFormattedDate(epochtime).c_str());
    }
}

// Update weather data display with enhanced visuals
void update_weather_cb(lv_timer_t *timer) {
  weather.weather_is_valid = weatherData();
  weather.UTC_Offset_is_valid = getUtcOffset(weather.lat, weather.lon, config.time_offset);
  if (weather.UTC_Offset_is_valid==false) config.time_offset = 0;
  // Update weather data with icons
  update_label(ui.lblTemperature, LV_SYMBOL_BATTERY_3 " %d°C", weather.temperature);
  update_label(ui.lblHumidity, LV_SYMBOL_TINT " %d%%", weather.relative_humidity);
  update_label(ui.lblWindSpeed, LV_SYMBOL_GPS " %d km/h", weather.wind_speed_kmh);
  update_label(ui.lblPressure, LV_SYMBOL_POWER " %d hPa", weather.pressure);
  update_label(ui.lblAirportName, LV_SYMBOL_HOME " %s", weather.airport_name);
  if (timeClient.isTimeSet() && weather.obsTime > 0) {
    unsigned long epochtime = timeClient.getEpochTime();
    unsigned long data_age_min = (epochtime - config.time_offset - weather.obsTime) / 60;
    update_label(ui.lblDataAge, LV_SYMBOL_REFRESH " %lu min ago", data_age_min);
    log_i("Temperature: %d", (int)weather.temperature);
    log_i("Relative humidity: %d%%", (int)weather.relative_humidity);
    log_i("Wind speed: %d km/h", (int)weather.wind_speed_kmh);
    log_i("Pressure: %d hPa", (int)weather.pressure);
    log_i("Data age: %u min", data_age_min);
    log_i("Epochtime: %u sec", epochtime);
      // Calculate and display sunrise/sunset
    if (weather.lat != 0 && weather.lon != 0) {
      weather.sunrise = sun_event(epochtime, weather.lat, weather.lon, true, config.time_offset);
      weather.sunset = sun_event(epochtime, weather.lat, weather.lon, false, config.time_offset);
      log_i("Next sunrise: %s", weather.sunrise.c_str());
      log_i("Next sunset: %s", weather.sunset.c_str());
      update_label(ui.lblSunrise, LV_SYMBOL_UP " %s", weather.sunrise.c_str());
      update_label(ui.lblSunset, LV_SYMBOL_DOWN " %s", weather.sunset.c_str());
    } else {
      update_label(ui.lblSunrise, LV_SYMBOL_UP " --:--");
      update_label(ui.lblSunset, LV_SYMBOL_DOWN " --:--");
    }
  } else {
    update_label(ui.lblDataAge, LV_SYMBOL_REFRESH " -- min ago");
    update_label(ui.lblSunrise, LV_SYMBOL_UP " --:--");
    update_label(ui.lblSunset, LV_SYMBOL_DOWN " --:--");
  }
}

// Initialize hardware and software
void setup() {
  Serial.begin(115200);
  while (!Serial) delay(10);
  Serial.setDebugOutput(true);
  log_i("Booting...");
  uint32_t chipId1 = 0, chipId2 = 0;
  uint64_t mac = ESP.getEfuseMac();
  chipId1 = (uint32_t)(mac >> 24) & 0xFFFFFF;
  uint8_t macAddr[6];
  WiFi.macAddress(macAddr);
  chipId2 = (macAddr[3] << 16) | (macAddr[4] << 8) | macAddr[5];

  log_i("Chip ID1 (EFuse): %u", chipId1);
  log_i("Chip ID2 (Wi-Fi MAC): %u", chipId2);
  log_i("CPU: %s rev%d, CPU Freq: %d Mhz, %d core(s)", ESP.getChipModel(), ESP.getChipRevision(), getCpuFrequencyMhz(), ESP.getChipCores());
  log_i("Board: %s", BOARD_NAME);
  log_i("SDK version: %s", ESP.getSdkVersion());
  log_i("PSRAM total: %u", ESP.getPsramSize());
  log_i("PSRAM free:  %u", ESP.getFreePsram());
  log_i("Heap free:   %d bytes", ESP.getFreeHeap());
  smartdisplay_init();
  smartdisplay_lcd_set_backlight(1.0);
  load_configurations();
  WiFi.mode(WIFI_STA);
  ui_init();
  lv_timer_create(update_time_cb, 1000, NULL);
  lv_timer_create(update_weather_cb, 60000, NULL);
  lv_timer_create(wifi_management_cb, 1000, NULL);
  timeClient.setTimeOffset(config.time_offset);
  timeClient.begin();
}

auto lv_last_tick = millis();
void loop() {
  auto now = millis();
  lv_tick_inc(now - lv_last_tick);
  lv_last_tick = now;
  lv_timer_handler();
}
